0:n: :tag:-instructions.
       1:n: :tag:-operation pic XX value "00" occurs :stacksize: times.
0:n: :tag:-counter pic 9.
0:n: :tag:-state pic x(50).
0:n: :tag:-identity pic 99.
0:n: :tag:-children pic 99.
