0:n: :tag:-instructions.
       1:n: :tag:-stack pic X value "0" occurs :stacksize: times.
0:n: :tag:-identity pic 999.
0:n: :tag:-state pic x(50).
0:n: :tag:-parent pic 999.
